# Pandas_8 Merge DataFrames
<hr style="border-top: 2px solid #8c1aff;">

In [6]:
import pandas as pd
temperature_df=pd.DataFrame({
    "city": ["Mumbai", "Delhi", "Banglore"],
    "temperature": [32,45,30],
})
temperature_df

       city  temperature
0    Mumbai           32
1     Delhi           45
2  Banglore           30

In [7]:
windspeed_df=pd.DataFrame({
    "city": ["Delhi", "Mumbai"],
    "windpeed": [80, 60]
})
windspeed_df

     city  windpeed
0   Delhi        80
1  Mumbai        60

In [8]:
#here if u normally concat we will get like this
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature    city  windpeed
0    Mumbai           32   Delhi      80.0
1     Delhi           45  Mumbai      60.0
2  Banglore           30     NaN       NaN

In [9]:
#this is not in order

In [10]:
# so we use index for it,but fore millions of data it is not possible to search and index them evrytime so we use merge instead of it

In [11]:
df1=pd.merge(temperature_df,windspeed_df,on="city")
df1

     city  temperature  windpeed
0  Mumbai           32        60
1   Delhi           45        80

In [12]:
df1.to_csv("merged_data.csv",index=False)

In [13]:
df3=pd.read_csv("merged_data.csv")
df3

     city  temperature  windpeed
0  Mumbai           32        60
1   Delhi           45        80

In [14]:
import pandas as pd
temperature_1_df=pd.DataFrame({
    "city": ["UNO", "Delhi", "Banglore"],
    "temperature": [32,45,30],
})
temperature_1_df

       city  temperature
0       UNO           32
1     Delhi           45
2  Banglore           30

In [15]:
df5=pd.merge(temperature_1_df,temperature_df,on="city")
df5

       city  temperature_x  temperature_y
0     Delhi             45             45
1  Banglore             30             30

In [18]:
#here only delhi bangalore are coming i.e interlinked or common elements are been stored here and all other are left
#in database it is also called as inner join

In [24]:
df6=pd.merge(temperature_1_df,temperature_df,on="city",how="outer")
df6

       city  temperature_x  temperature_y
0  Banglore           30.0           30.0
1     Delhi           45.0           45.0
2    Mumbai            NaN           32.0
3       UNO           32.0            NaN

In [20]:
#here all are included as we took all the elements by default how="inner" will be here we adjust in such a way so that we are converting from intersection to union

In [22]:
#here this is called as outer join

In [23]:
#here also in place of how we can replace with it either right or left like left of intersection and intersection itself

In [26]:
df7=pd.merge(temperature_1_df,temperature_df,on="city",how="left")
df7

       city  temperature_x  temperature_y
0       UNO             32            NaN
1     Delhi             45           45.0
2  Banglore             30           30.0

In [28]:
#here if you observe there temperature_1_df is left dataframe so in it cties are UNO,delhi,bangalore, in intersection UNO,delhi,bangalore,
#left of it nbothing are left but in right mumbai is left where it is not getting printed

**to know from which the data come from we can use a thing called indicator so that we can understand from where data was been taken and merged**

In [33]:
df8=pd.merge(temperature_1_df,temperature_df,on="city",how="left",indicator=True)
df8

       city  temperature_x  temperature_y     _merge
0       UNO             32            NaN  left_only
1     Delhi             45           45.0       both
2  Banglore             30           30.0       both

In [34]:
#here u could get a clear detail on them

In [35]:
df9= pd.DataFrame({ "city": ["new york", "chicago", "orlando", "baltimore"],
"temperature": [21,14,35,38],
"humidity": [65,68,71, 75]
})
df9

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [36]:
df10= pd.DataFrame({
"city": ["chicago", "new york", "san diego"],
"temperature": [21,14,35],
"humidity": [65,68,71]
})
df10

        city  temperature  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [37]:
df11=pd.merge(df9,df10,on="city")
df11

       city  temperature_x  humidity_x  temperature_y  humidity_y
0  new york             21          65             14          68
1   chicago             14          68             21          65

In [38]:
#here this will automatically append _x,_y for the dataframes as we have same humidity,temeperature column in both df

In [39]:
#here to change suffix names we can use

In [42]:
df11=pd.merge(df9,df10,on="city",suffixes=['_left','_right'])
df11

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,new york,21,65,14,68
1,chicago,14,68,21,65